Функция ВерсияФорматаМенеджераОбмена() Экспорт
    Возврат "2";
КонецФункции

Процедура ДобавитьПКО_Товары()
    ДобавитьПКС(Свойства, "Код", "Код");
    ДобавитьПКС(Свойства, "Наименование", "Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Контрагенты()
    ДобавитьПКС(Свойства, "Код", "Код");
КонецПроцедуры

Процедура ДобавитьПОД_Товары()
КонецПроцедуры

Процедура ДобавитьПКС(Свойства, Источник, Приемник)
КонецПроцедуры

Процедура ПКО_Товары_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO)
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных()
    Правило.ИмяПКПД = "ВидыТоваров";
КонецПроцедуры

#Область Алгоритмы
Функция НайтиТовар()
КонецФункции
#КонецОбласти
// ДобавитьПКС(НеСчитать);
// Процедура ДобавитьПКО_НеСчитать()
