Процедура ПриПолученииНастроек(Настройки) Экспорт
    Настройки.ЭтоПланОбменаXDTO = Истина;
    Настройки.ФорматОбмена = "urn:example:base";
    ВерсииФормата = Новый Соответствие;
    ВерсииФормата.Вставить("1.1", МенеджерОдин);
    ВерсииФормата.Вставить("1.2", МенеджерДва);
    ВерсииФормата.Вставить("1.3", МенеджерТри);
    ВерсииФормата.Вставить("1.4", МенеджерСтранный);
    ВерсииФормата.Вставить("1.5", МенеджерБезТела);
    ВерсииФормата.Вставить("1.6", МенеджерНигде);
    Настройки.ВерсииФорматаОбмена = ВерсииФормата;

КонецПроцедуры
