// Сформировано из решений автора. Заголовочный проход не изменяет правила.
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура доп_ЗаполнитьПравилаКонвертацииОбъектов(КомпонентыОбмена, ПравилаКонвертации, ТолькоЗаголовки)

	Если Не ТолькоЗаголовки Тогда
		Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
			Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
			Если Правило <> Неопределено Тогда
				Правило.ПриОтправкеДанных = "доп_ПКО_a9575f03afa2dfa5";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура доп_Диспетчер(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "доп_ПКО_a9575f03afa2dfa5" Тогда
		доп_ПКО_a9575f03afa2dfa5(Параметры.ДанныеИБ, Параметры.ДанныеXDTO,
			Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	Иначе
		ПродолжитьВызов(ИмяПроцедуры, Параметры);
	КонецЕсли;
КонецПроцедуры

Процедура доп_ПКО_a9575f03afa2dfa5(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Типовой(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки);
Возврат;
КонецПроцедуры
