// Сформировано из решений автора. Пересобирать комплект целиком.
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура доп_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)

	Если НаправлениеОбмена = "Отправка" Тогда
		Правило = ПравилаКонвертации.Найти("Заказ", "ИмяПКО");
		Если Правило <> Неопределено Тогда
			Правило.ПриОтправкеДанных = "доп_ПКО_7ff9ee2e8e2dc3bc";
		КонецЕсли;
		Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
		Если Правило <> Неопределено Тогда
			Правило.ПриОтправкеДанных = "доп_ПКО_a9575f03afa2dfa5";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура доп_Диспетчер(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "доп_ПКО_7ff9ee2e8e2dc3bc" Тогда
		доп_ПКО_7ff9ee2e8e2dc3bc(Параметры.ДанныеИБ, Параметры.ДанныеXDTO,
			Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "доп_ПКО_a9575f03afa2dfa5" Тогда
		доп_ПКО_a9575f03afa2dfa5(Параметры.ДанныеИБ, Параметры.ДанныеXDTO,
			Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	Иначе
		ПродолжитьВызов(ИмяПроцедуры, Параметры);
	КонецЕсли;
КонецПроцедуры

Процедура доп_ПКО_7ff9ee2e8e2dc3bc(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
Возврат;
КонецПроцедуры

Процедура доп_ПКО_a9575f03afa2dfa5(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
Возврат;
КонецПроцедуры
