// Сформировано из решений автора. Заголовочный проход не изменяет правила.
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура доп_ЗаполнитьПравилаКонвертацииОбъектов(КомпонентыОбмена, ПравилаКонвертации, ТолькоЗаголовки)

	Если Не ТолькоЗаголовки Тогда
		Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
			Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
			Если Правило <> Неопределено Тогда
				Правило.ПриКонвертацииДанныхXDTO = "доп_ПКО_d8019c171759fb7f";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура доп_Диспетчер(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "доп_ПКО_d8019c171759fb7f" Тогда
		доп_ПКО_d8019c171759fb7f(Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	Иначе
		ПродолжитьВызов(ИмяПроцедуры, Параметры);
	КонецЕсли;
КонецПроцедуры

Процедура доп_ПКО_d8019c171759fb7f(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	Типовой(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена);
Возврат;
КонецПроцедуры
