Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	ДатаСоздания = Дата(2026, 10, 3);
	Наименование = НСтр("ru = 'Заказы'");
	Синоним = "Узел заказов";
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ДатаВремяСоздания", ДатаСоздания);
	Результат.Вставить("ПланаОбмена", "УзелЗаказов");
	Результат.Вставить("СинонимКонфигурации", Синоним);
	Возврат Результат;
КонецФункции

Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	Если ПравилаРегистрацииОбъектов.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ПравилаРегистрацииОбъектов.Колонки.Добавить("Идентификатор");
	КонецЕсли;
	ДобавитьПРО_Документ_ЗаказПовтор(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

Процедура ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ИмяПланаОбмена = "УзелЗаказов";
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Товары";
	НовоеПравило.ИмяРеквизитаФлага = "";
	НовоеПравило.Идентификатор = "Узел#1";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь;
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	УстановитьОтборы(НовоеПравило, ОтборПланаТовары(), "<ОтборПоСвойствамОбъекта>
	|<ЭлементОтбора>
	|<СвойствоОбъекта>НетПоля</СвойствоОбъекта>
	|</ЭлементОтбора>
	|</ОтборПоСвойствамОбъекта>");
КонецПроцедуры

Процедура ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ИмяПланаОбмена = "УзелЗаказов";
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.Заказ";
	НовоеПравило.ИмяРеквизитаФлага = "ВыгружатьЗаказы";
	НовоеПравило.Идентификатор = "Повтор";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь;
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Истина;
	УстановитьОтборы(НовоеПравило, ОтборПланаЗаказ(), ОтборПустой());
КонецПроцедуры

Процедура ДобавитьПРО_Документ_ЗаказПовтор(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ИмяПланаОбмена = "УзелЗаказов";
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.Заказ";
	НовоеПравило.ИмяРеквизитаФлага = "";
	НовоеПравило.Идентификатор = "Повтор";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Истина;
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	УстановитьОтборы(НовоеПравило, ОтборПланаЗаказ(), ОтборПустой());
КонецПроцедуры

Функция ОтборПланаЗаказ()
	Возврат "<ОтборПоСвойствамПланаОбмена><ЭлементОтбора><ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты><СвойствоПланаОбмена>ВыгружатьЗаказы</СвойствоПланаОбмена><СвойствоОбъекта>""да""</СвойствоОбъекта></ЭлементОтбора></ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция ОтборПланаТовары()
	Возврат "<ОтборПоСвойствамПланаОбмена><Пометка>черновик</Пометка><ЭлементОтбора><ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты><СвойствоПланаОбмена>ВыгружатьТовары</СвойствоПланаОбмена><СвойствоОбъекта>1</СвойствоОбъекта></ЭлементОтбора></ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция ОтборПустой()
	Возврат "<ОтборПоСвойствамОбъекта/>";
КонецФункции

Процедура ПередОбработкой(Отказ, ПРО, Объект)
	Если ПРО.Идентификатор = "Повтор" Тогда
		ПРО_ПередОбработкой(Отказ, ПРО, Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОбработке(Отказ, ПРО, Объект)
	Если ПРО.Идентификатор = "Повтор" Тогда
		ПРО_ПриОбработке(Отказ, ПРО, Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОбработкеДополнительный(Отказ, ПРО, Объект)
	Если ПРО.Идентификатор = "Повтор" Тогда
		ПРО_ПриОбработкеДополнительный(Отказ, ПРО, Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ПослеОбработки(Отказ, ПРО, Объект)
	Если ПРО.Идентификатор = "Повтор" Тогда
		ПРО_ПослеОбработки(Отказ, ПРО, Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ПакетнаяОбработка(Отказ, ПРО, Объект)
	Если ПРО.Идентификатор = "Повтор" Тогда
		ПРО_ПакетнаяОбработка(Отказ, ПРО, Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_ПередОбработкой(Отказ, ПРО, Объект)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_ПриОбработке(Отказ, ПРО, Объект)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_ПриОбработкеДополнительный(Отказ, ПРО, Объект)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_ПослеОбработки(Отказ, ПРО, Объект)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_ПакетнаяОбработка(Отказ, ПРО, Объект)
	Отказ = Истина;
КонецПроцедуры

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
КонецПроцедуры
