Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

Процедура ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.Заказ";
	НовоеПравило.Идентификатор = "ЗаказБитый";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	УстановитьОтборы(НовоеПравило, ОтборБитый(), ОтборОбъектаТовары());
КонецПроцедуры

Процедура ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Товары";
	НовоеПравило.Идентификатор = "ТоварыЦелые";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	УстановитьОтборы(НовоеПравило, ОтборПланаТовары(), ОтборОбъектаТовары());
КонецПроцедуры

Функция ОтборБитый()
	Возврат "<ОтборПоСвойствамПланаОбмена><ЭлементОтбора></ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция ОтборПланаТовары()
	Возврат "<ОтборПоСвойствамПланаОбмена/>";
КонецФункции

Функция ОтборОбъектаТовары()
	Возврат "<ОтборПоСвойствамОбъекта/>";
КонецФункции

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
КонецПроцедуры
