Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Результат.Вставить("ПланаОбмена", "УзелЗаказов");
	Возврат Результат;
КонецФункции

Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

Процедура ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ИмяПланаОбмена = "УзелЗаказов";
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.Заказ";
	НовоеПравило.ИмяРеквизитаФлага = "ВыгружатьЗаказы";
	НовоеПравило.Идентификатор = "ЗаказВыгружать";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь;
	УстановитьОтборы(НовоеПравило, ОтборПлана(), ОтборОбъекта());
КонецПроцедуры

Функция ОтборПлана()
	Возврат "<ОтборПоСвойствамПланаОбмена><ЭлементОтбора><ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты><СвойствоПланаОбмена>ВыгружатьТовары</СвойствоПланаОбмена><СвойствоОбъекта>константа</СвойствоОбъекта></ЭлементОтбора></ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция ОтборОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта><ЭлементОтбора><СвойствоОбъекта>НетПоля</СвойствоОбъекта></ЭлементОтбора></ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
КонецПроцедуры
