Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	Для Каждого Строка Из Таблица Цикл
		ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	КонецЦикла;
	ВнешнийМодуль.ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

Процедура ДобавитьПРО_Документ_Заказ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.Заказ";
	НовоеПравило.Идентификатор = "Заказ";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
	УстановитьОтборы(НовоеПравило, Склейка(), Фильтры.План());
КонецПроцедуры

Процедура ДобавитьПРО_Справочник_Товары(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Товары";
	НовоеПравило.Идентификатор = "Товары";
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации;
КонецПроцедуры

Функция Склейка()
	Возврат "<Отбор" + "ПоСвойствамПланаОбмена/>";
КонецФункции

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
КонецПроцедуры
