Функция ВерсияФорматаМенеджераОбмена() Экспорт
    Возврат "2";
КонецФункции
Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПередОбработкойУдаляемогоОбъекта(КомпонентыОбмена, УдаляемыйОбъект) Экспорт
КонецПроцедуры
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
    ДобавитьПОД_Товары(ПравилаОбработкиДанных);
КонецПроцедуры
Процедура ДобавитьПОД_Товары(ПравилаОбработкиДанных)
    ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
    ПравилоОбработки.Имя = "Товары";
    ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Товары;
    ПравилоОбработки.ОбъектВыборкиФормат = "Catalog.Product";
    ПравилоОбработки.ИспользуемыеПКО = Новый Массив;
    ПравилоОбработки.ИспользуемыеПКО.Добавить("Товар");
КонецПроцедуры
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
    ДобавитьПКО_Товар(ПравилаКонвертации);
КонецПроцедуры
Процедура ДобавитьПКО_Товар(ПравилаКонвертации)
    ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
    ПравилоКонвертации.ИмяПКО = "Товар";
    ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Товары;
    ПравилоКонвертации.ОбъектФормата = "Catalog.Product";
    ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
    ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Товар_ПриОтправкеДанных";
    СвойстваШапки = ПравилоКонвертации.Свойства;
    ДобавитьПКС(СвойстваШапки, "Наименование", "Description");
КонецПроцедуры
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
КонецПроцедуры
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
    ПараметрыКонвертации.Вставить("РежимДемо", Ложь);
КонецПроцедуры
Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
    НоваяСтрока = РодительПКС.Добавить();
    НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
    НоваяСтрока.СвойствоФормата = СвойствоФормата;
    НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
    НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
    НоваяСтрока.ПространствоИмен = ПространствоИмен;
КонецПроцедуры
Процедура ПКО_Товар_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
    ДанныеXDTO.Вставить("Description", ДанныеИБ.Наименование);
КонецПроцедуры
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
    Если ИмяПроцедуры = "ПКО_Товар_ПриОтправкеДанных" Тогда
        ПКО_Товар_ПриОтправкеДанных(Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
    КонецЕсли;
КонецПроцедуры
