&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура Доп_ПКО(КомпонентыОбмена, ПравилаКонвертации, ТолькоЗаголовки)
    Если Не ТолькоЗаголовки Тогда
        Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
            Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
            Если Правило <> Неопределено Тогда
                Свойство = Правило.Свойства.Найти("Комментарий", "СвойствоФормата");
                Если Свойство = Неопределено Тогда
                    ДобавитьПКС(Правило.Свойства, "ДопМетка", "Комментарий");
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
