// Сформировано из решений автора. Пересобирать комплект целиком.
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура доп_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)

	Если НаправлениеОбмена = "Получение" Тогда
		Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
		Если Правило <> Неопределено Тогда
			Правило.ПриКонвертацииДанныхXDTO = "доп_ПКО_d8019c171759fb7f";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура доп_Диспетчер(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "доп_ПКО_d8019c171759fb7f" Тогда
		доп_ПКО_d8019c171759fb7f(Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	Иначе
		ПродолжитьВызов(ИмяПроцедуры, Параметры);
	КонецЕсли;
КонецПроцедуры

Процедура доп_ПКО_d8019c171759fb7f(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
Возврат;
КонецПроцедуры
