// Сформировано из решений автора. Пересобирать комплект целиком.
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура доп_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)

	Если НаправлениеОбмена = "Получение" Тогда
		Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
		Если Правило <> Неопределено Тогда
			Правило.ПередЗаписьюПолученныхДанных = "доп_ПКО_f827df9e22fff383";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура доп_Диспетчер(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "доп_ПКО_f827df9e22fff383" Тогда
		доп_ПКО_f827df9e22fff383(Параметры.ПолученныеДанные, Параметры.ДанныеИБ,
			Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	Иначе
		ПродолжитьВызов(ИмяПроцедуры, Параметры);
	КонецЕсли;
КонецПроцедуры

Процедура доп_ПКО_f827df9e22fff383(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Типовой(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена);
Возврат;
КонецПроцедуры
