Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2";
КонецФункции

Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	ДобавитьПКО_Товар(ПравилаКонвертации);
	ДобавитьПКО_Заказ(ПравилаКонвертации);
КонецПроцедуры

Процедура ДобавитьПКО_Товар(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Товар";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Товары;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Товары";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код", "Код");
КонецПроцедуры

Процедура ДобавитьПКО_Заказ(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Заказ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.Заказ;
	ПравилоКонвертации.ОбъектФормата = "Документ.Заказ";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код", "Код");
КонецПроцедуры

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации,
СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0,
ПравилоКонвертацииСвойства = "", ПространствоИмен = "")

НоваяСтрока = РодительПКС.Добавить();
НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
НоваяСтрока.СвойствоФормата = СвойствоФормата;
НоваяСтрока.ИспользуетсяАлгоритмКонвертации =
?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
НоваяСтрока.ПространствоИмен = ПространствоИмен;
КонецПроцедуры
