Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "3";
КонецФункции

Процедура ЗаполнитьПравилаКонвертацииОбъектов(КомпонентыОбмена, ПравилаКонвертации, ТолькоЗаголовки = Ложь) Экспорт
	ВерсияФорматаОбмена = КомпонентыОбмена.ВерсияФорматаОбмена;
	ДобавитьПКО_Товар(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки);
	ДобавитьПКО_Заказ(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки);
КонецПроцедуры

Процедура ДобавитьПКО_Товар(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Товар";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Товары;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Товары";
	Если ТолькоЗаголовки Тогда Возврат; КонецЕсли;
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код", "Код");
КонецПроцедуры

Процедура ДобавитьПКО_Заказ(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Заказ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.Заказ;
	ПравилоКонвертации.ОбъектФормата = "Документ.Заказ";
	Если ТолькоЗаголовки Тогда Возврат; КонецЕсли;
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код", "Код");
КонецПроцедуры

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации,
СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0,
ПравилоКонвертацииСвойства = "", ПространствоИмен = "")

НоваяСтрока = РодительПКС.Добавить();
НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
НоваяСтрока.СвойствоФормата = СвойствоФормата;
НоваяСтрока.ИспользуетсяАлгоритмКонвертации =
?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
НоваяСтрока.ПространствоИмен = ПространствоИмен;
КонецПроцедуры
