Функция ВерсияФорматаМенеджераОбмена() Экспорт
    Возврат "3";
КонецФункции
Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПередОбработкойУдаляемогоОбъекта(КомпонентыОбмена, УдаляемыйОбъект) Экспорт
КонецПроцедуры
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
КонецПроцедуры
Процедура ЗаполнитьПравилаКонвертацииОбъектов(КомпонентыОбмена, ПравилаКонвертации, ТолькоЗаголовки) Экспорт
    НаправлениеОбмена = КомпонентыОбмена.НаправлениеОбмена;
    ВерсияФорматаОбмена = КомпонентыОбмена.ВерсияФорматаОбмена;
    Если Не ТолькоЗаголовки Тогда
        Если НаправлениеОбмена = "Отправка" Тогда
            ДобавитьПКО_Товар(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
Процедура ДобавитьПКО_Товар(ПравилаКонвертации, ВерсияФорматаОбмена, ТолькоЗаголовки)
    ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
    ПравилоКонвертации.ИмяПКО = "Товар";
    ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Товары;
    ПравилоКонвертации.ОбъектФормата = "Catalog.Product";
    СвойстваШапки = ПравилоКонвертации.Свойства;
    ДобавитьПКС(СвойстваШапки, "Наименование", "Description");
КонецПроцедуры
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
КонецПроцедуры
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры
Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
    НоваяСтрока = РодительПКС.Добавить();
    НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
    НоваяСтрока.СвойствоФормата = СвойствоФормата;
    НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
    НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
    НоваяСтрока.ПространствоИмен = ПространствоИмен;
КонецПроцедуры
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
    Если ИмяПроцедуры = "ПКО_Товар_ПриОтправкеДанных" Тогда
        ПКО_Товар_ПриОтправкеДанных(Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
    КонецЕсли;
КонецПроцедуры
Процедура ПКО_Товар_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
КонецПроцедуры
