Процедура доп_Сохранить(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Отсутствующие = "";
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство(
		"СвойстваОтсутствующиеВПолученныхДанных", Отсутствующие) Тогда
		Имена = СтрРазделить(Отсутствующие, ",", Ложь);
		Для Индекс = 0 По Имена.ВГраница() Цикл
			Имена[Индекс] = СокрЛП(Имена[Индекс]);
		КонецЦикла;
		Если Имена.Найти("Комментарий") <> Неопределено Тогда
			Если Имена.Найти("доп_Заметка") = Неопределено Тогда
				Имена.Добавить("доп_Заметка");
				ПолученныеДанные.ДополнительныеСвойства.Вставить(
					"СвойстваОтсутствующиеВПолученныхДанных", СтрСоединить(Имена, ","));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
