&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура Доп_ПКО(НаправлениеОбмена, ПравилаКонвертации)
    Правило = ПравилаКонвертации.Найти("Товар", "ИмяПКО");
    Если Правило <> Неопределено Тогда
        Свойства = Правило.Свойства;
        ДобавитьПКС(Свойства, "ДопКод", "Code");
    КонецЕсли;
    Если НаправлениеОбмена = "Отправка" Тогда
        ДобавитьПКО_ДопЗаказ(ПравилаКонвертации);
    КонецЕсли;
КонецПроцедуры
Процедура ДобавитьПКО_ДопЗаказ(ПравилаКонвертации)
    ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
    ПравилоКонвертации.ИмяПКО = "ДопЗаказ";
    ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.Заказ;
    ПравилоКонвертации.ОбъектФормата = "Document.Order";
    ПравилоКонвертации.ПриОтправкеДанных = "Доп_Заказ_Отправка";
    СвойстваШапки = ПравилоКонвертации.Свойства;
    ДобавитьПКС(СвойстваШапки, "", "Comment", 1);
КонецПроцедуры
&После("ЗаполнитьПравилаОбработкиДанных")
Процедура Доп_ПОД(НаправлениеОбмена, ПравилаОбработкиДанных)
    Если НаправлениеОбмена = "Отправка" Тогда
        ДобавитьПОД_ДопЗаказы(ПравилаОбработкиДанных);
    КонецЕсли;
КонецПроцедуры
Процедура ДобавитьПОД_ДопЗаказы(ПравилаОбработкиДанных)
    ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
    ПравилоОбработки.Имя = "ДопЗаказы";
    ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.Заказ;
    ПравилоОбработки.ИспользуемыеПКО = Новый Массив;
    ПравилоОбработки.ИспользуемыеПКО.Добавить("ДопЗаказ");
КонецПроцедуры
&После("ЗаполнитьПравилаКонвертацииПредопределенныхДанных")
Процедура Доп_ПКПД(НаправлениеОбмена, ПравилаКонвертации)
    ПравилоКонвертации = ПравилаКонвертации.Добавить();
    ПравилоКонвертации.ИмяПКПД = "ДопСостояния";
    ПравилоКонвертации.ТипДанных = "ПеречислениеСсылка.СостоянияЗаказа";
    ПравилоКонвертации.ТипXDTO = "OrderState";
    ЗначенияДляОтправки = Новый Соответствие;
    ЗначенияДляПолучения = Новый Соответствие;
    ЗначенияДляОтправки.Вставить(Перечисления.СостоянияЗаказа.Новый, "New");
    ЗначенияДляПолучения.Вставить("New", Перечисления.СостоянияЗаказа.Новый);
    ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
    ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
КонецПроцедуры
&После("ЗаполнитьПараметрыКонвертации")
Процедура Доп_Параметры(ПараметрыКонвертации)
    ПараметрыКонвертации.Вставить("РежимДемо", Истина);
КонецПроцедуры
&Вместо("ВыполнитьПроцедуруМодуляМенеджера")
Процедура Доп_Диспетчер(ИмяПроцедуры, Параметры)
    Если ИмяПроцедуры = "Доп_Заказ_Отправка" Тогда
        Доп_Заказ_Отправка(Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
    Иначе
        ПродолжитьВызов(ИмяПроцедуры, Параметры);
    КонецЕсли;
КонецПроцедуры
Процедура Доп_Заказ_Отправка(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
    ДанныеXDTO.Вставить("Comment", "Демонстрация");
КонецПроцедуры
