// Вымышленные имена для профильных проверок.
Функция ВерсияФорматаМенеджераОбмена() Экспорт
    Возврат "2";
КонецФункции

Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
КонецПроцедуры
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
    ДобавитьПКО_Тест(ПравилаКонвертации);
КонецПроцедуры
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
    ДобавитьПОД_Тест(ПравилаОбработкиДанных);
КонецПроцедуры
Процедура ДобавитьПОД_Тест(ПравилаОбработкиДанных)
    ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
    ПравилоОбработки.Имя = "Тест";
    ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.Тест";
    ПравилоОбработки.ИспользуемыеПКО.Добавить("Тест");
КонецПроцедуры
Процедура ДобавитьПКО_Тест(ПравилаКонвертации)
    ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
    ПравилоКонвертации.ИмяПКО = "Тест";
    ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Тест;
    ПравилоКонвертации.ОбъектФормата = "Справочник.Тест";
    СвойстваШапки = ПравилоКонвертации.Свойства;
    ДобавитьПКС(СвойстваШапки, "Код", "Код", 0);
    // <properties>
КонецПроцедуры
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры
Функция ВыполнитьФункциюМодуляМенеджера(ИмяФункции, Параметры) Экспорт
КонецФункции

Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
    ПравилоКонвертации = ПравилаКонвертации.Добавить();
    ПравилоКонвертации.ИмяПКПД = "Выбор";
    ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.Выбор;
    ПравилоКонвертации.ТипXDTO = "Выбор";
    ЗначенияДляОтправки = Новый Соответствие;
    ЗначенияДляОтправки.Вставить(Перечисления.Выбор.А, "A");
    ЗначенияДляПолучения = Новый Соответствие;
    ЗначенияДляПолучения.Вставить("A", Перечисления.Выбор.А);
КонецПроцедуры
