// Сверенная форма генератора, имена параметров не имеют специальной семантики.
Функция ВерсияФорматаЧислом(СтрокаВерсии) Экспорт
    Если Не ЗначениеЗаполнено(СтрокаВерсии) Или СтрокаВерсии = "1.0.beta" Тогда
        Возврат 0;
    КонецЕсли;
    ВерсияФорматаЧислом = 0;
    РазрядыВерсии = СтрРазделить(СтрокаВерсии, ".");
    Если РазрядыВерсии.Количество() <> 2 Тогда
        ВызватьИсключение "Неверная версия";
    КонецЕсли;
    МножительРазряда = 10000;
    Для ИндексРазрядаОбратный = 0 По 1 Цикл
        ВерсияФорматаЧислом = ВерсияФорматаЧислом +
            Число(РазрядыВерсии[ИндексРазрядаОбратный])*МножительРазряда;
        МножительРазряда = МножительРазряда / 100;
    КонецЦикла;
    Возврат ВерсияФорматаЧислом;
КонецФункции
