Функция ВерсияФорматаМенеджераОбмена() Экспорт
    Возврат "2";
КонецФункции

Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
    ДобавитьПКО_Товар(ПравилаКонвертации);
КонецПроцедуры

Процедура ДобавитьПКО_Товар(ПравилаКонвертации)
    Правило = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
    Правило.ИмяПКО = "Товар";
    Правило.ОбъектДанных = Метаданные.Справочники.Товары;
    Правило.ОбъектФормата = "Catalog.Goods";
КонецПроцедуры
