Процедура Заполнить(ВерсииФормата, ВариантНастройки = "") Экспорт
    // ВерсииФормата.Вставить("8.8", ЛожныйМодуль);
    Текст = "ВерсииФормата.Вставить(""8.8"", ЛожныйМодуль)";
    Продолжение = "первая
    |вторая";
    Если СтрНайти(Продолжение, ",") = 0 Тогда
        Текст = Текст;
    КонецЕсли;
    Если Не ЗначениеЗаполнено(ВариантНастройки) Тогда
        ВерсииФормата.Вставить("1.8", МенеджерОбменаПример);
        версииформата.ВСТАВИТЬ("1.6", менеджеробменапример);
    ИначеЕсли ВариантНастройки = КодВариантаОсобый() Тогда
        ВерсииФормата.Вставить("2.0", МенеджерОбменаПример);
    Иначе
        ВерсииФормата.Вставить("9.0", МенеджерОбменаПример);
    КонецЕсли;
КонецПроцедуры

Функция КодВариантаОсобый()
    Возврат "Особый";
КонецФункции
