// Менеджер обмена через универсальный формат (Manager)

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыКонвертации

Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры

Функция ВыполнитьФункциюМодуляМенеджера(ИмяФункции, Параметры) Экспорт
КонецФункции

#КонецОбласти

Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2";
КонецФункции

Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
КонецПроцедуры

Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПОД

#КонецОбласти

#Область ПКО

#КонецОбласти

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область ОбработчикиКонвертации

#КонецОбласти

#КонецОбласти
