// Менеджер обмена через универсальный формат (ImportManager)

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыКонвертации

Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры

Функция ВыполнитьФункциюМодуляМенеджера(ИмяФункции, Параметры) Экспорт
КонецФункции

#КонецОбласти

Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2";
КонецФункции

Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_ItemSend(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	ДобавитьПКО_Item(ПравилаКонвертации);
КонецПроцедуры

Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
КонецПроцедуры

Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПОД
Процедура ДобавитьПОД_ItemSend(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "ItemSend";
КонецПроцедуры

#КонецОбласти

#Область ПКО
Процедура ДобавитьПКО_Item(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Item";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Code", "Code");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "Rows", "Rows");
	ДобавитьПКС(СвойстваТЧ, "Quantity", "Quantity");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "",     "Lines");
	ДобавитьПКС(СвойстваТЧ, "", "Value", 1);

КонецПроцедуры

#КонецОбласти

Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата, ПространствоИмен = "")
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	КонвертацияТабличнойЧасти.ПространствоИмен = ПространствоИмен;
	Возврат КонвертацияТабличнойЧасти.Свойства;
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область ОбработчикиКонвертации

#КонецОбласти

#КонецОбласти
